### Slicing data from the Pandas DataFrame:

In [1]:
 # 1) loc for label-based slicing:Selecting rows and columns using labels # last index included
 # 2) iloc for positional slicing:Selecting rows and columns by integer position # last index excluded
 # 3) at for quick access to single values
 # 4) iat for quick access to single values by position

In [2]:
import pandas as pd

In [3]:
dt=pd.read_excel(r"C:\Users\hi\Documents\Desktop\Minskole classes\Pandas\inputData.xlsx")
dt

   First Name Last Name  English  Physics  Chemistry  Mathematics
0       Aarav     Patil       85       78         90           92
1      Vihaan  Deshmukh       88       81         85           89
2       Ayaan    Jadhav       90       75         88           84
3       Arjun      More       76       89         91           78
4     Reyansh     Joshi       82       80         84           85
..        ...       ...      ...      ...        ...          ...
60      Tarun    Dhumal       82       87         81           85
61      Arnav   Khedkar       85       90         78           89
62      Payal     Patil       89       76         87           91
63      Rahul     Kadam       81       83         84           90
64        Jay    Bhagat       90       77         65           88

[65 rows x 6 columns]

In [4]:
dt.loc[0:5]

  First Name Last Name  English  Physics  Chemistry  Mathematics
0      Aarav     Patil       85       78         90           92
1     Vihaan  Deshmukh       88       81         85           89
2      Ayaan    Jadhav       90       75         88           84
3      Arjun      More       76       89         91           78
4    Reyansh     Joshi       82       80         84           85
5     Vivaan      Nair       87       83         79           90

In [5]:
dt.loc[0:5,["First Name","Last Name"]]

  First Name Last Name
0      Aarav     Patil
1     Vihaan  Deshmukh
2      Ayaan    Jadhav
3      Arjun      More
4    Reyansh     Joshi
5     Vivaan      Nair

In [6]:
dt.iloc[0:5]

  First Name Last Name  English  Physics  Chemistry  Mathematics
0      Aarav     Patil       85       78         90           92
1     Vihaan  Deshmukh       88       81         85           89
2      Ayaan    Jadhav       90       75         88           84
3      Arjun      More       76       89         91           78
4    Reyansh     Joshi       82       80         84           85

In [10]:
# dt.iloc[0:5,["First Name","Last Name"]]  ----> Not work

In [12]:
dt.iloc[0:5,[0,3,4]]

  First Name  Physics  Chemistry
0      Aarav       78         90
1     Vihaan       81         85
2      Ayaan       75         88
3      Arjun       89         91
4    Reyansh       80         84

In [16]:
dt.iloc[0:5,0:4]

  First Name Last Name  English  Physics
0      Aarav     Patil       85       78
1     Vihaan  Deshmukh       88       81
2      Ayaan    Jadhav       90       75
3      Arjun      More       76       89
4    Reyansh     Joshi       82       80

# at: Accessing a single value
data2.at[3, 'First Name']
       # Row labelled   Column labelled

In [18]:
dt.at[5,'First Name']

'Vivaan'

In [20]:
dt.iat[5,0]

'Vivaan'

In [22]:
# dt.at[1:4,"First Name"]  --------> KeyError: slice(1, 4, None)

In [25]:
dt1=dt.sort_values(by="Last Name", ascending=False)

In [26]:
dt1

   First Name    Last Name  English  Physics  Chemistry  Mathematics
47      Tejas     Waghmare       85       82         90           85
24      Tejas     Waghmare       85       82         90           85
7       Rohan  Suryavanshi       78       82         90           86
17      Rohan  Suryavanshi       78       82         90           86
9     Samarth       Shinde       89       79         87           88
..        ...          ...      ...      ...        ...          ...
18      Krish      Bhosale       80       85         83           89
56      Aarvi     Bhandari       90       81         85           91
33      Aarvi     Bhandari       90       81         85           91
41       Jaya       Bhagat       92       88         76           89
64        Jay       Bhagat       90       77         65           88

[65 rows x 6 columns]

In [29]:
dt1.head(10)

   First Name    Last Name  English  Physics  Chemistry  Mathematics
47      Tejas     Waghmare       85       82         90           85
24      Tejas     Waghmare       85       82         90           85
7       Rohan  Suryavanshi       78       82         90           86
17      Rohan  Suryavanshi       78       82         90           86
9     Samarth       Shinde       89       79         87           88
19    Samarth       Shinde       89       79         87           88
53      Aditi       Rajput       90       88         82           87
30      Aditi       Rajput       90       88         82           87
16     Aditya        Pawar       92       88         76           91
6      Aditya        Pawar       92       88         76           91

In [30]:
dt1.at[9,"First Name"]

'Samarth'

In [31]:
dt1.iat[9,0]

'Aditya'

In [32]:
# # Rename 
# # Syntax
# 1)Row labelled
#  dataframe_name.rename(index         = {1:"One",               4:"Four"} , inplace= True/False)
#                        For Row         Old value : New value,

# 2)Columns labelled
#  dataframe_name.rename(columns         = {1:"One",               4:"Four"} , inplace= True/False)
#                        For Column         Old value : New value,

In [41]:
dt.rename(index={
    0:'Zero',
    1:'One',
    2:'Two'},
    inplace=True
    )

In [42]:
dt

     First Name Last Name  English  Physics  Chemistry  Mathematics
Zero      Aarav     Patil       85       78         90           92
One      Vihaan  Deshmukh       88       81         85           89
Two       Ayaan    Jadhav       90       75         88           84
3         Arjun      More       76       89         91           78
4       Reyansh     Joshi       82       80         84           85
...         ...       ...      ...      ...        ...          ...
60        Tarun    Dhumal       82       87         81           85
61        Arnav   Khedkar       85       90         78           89
62        Payal     Patil       89       76         87           91
63        Rahul     Kadam       81       83         84           90
64          Jay    Bhagat       90       77         65           88

[65 rows x 6 columns]

In [43]:
dt.rename(columns={
    "English":"Eng",
    "Physics":"Phy"})

     First Name Last Name  Eng  Phy  Chemistry  Mathematics
Zero      Aarav     Patil   85   78         90           92
One      Vihaan  Deshmukh   88   81         85           89
Two       Ayaan    Jadhav   90   75         88           84
3         Arjun      More   76   89         91           78
4       Reyansh     Joshi   82   80         84           85
...         ...       ...  ...  ...        ...          ...
60        Tarun    Dhumal   82   87         81           85
61        Arnav   Khedkar   85   90         78           89
62        Payal     Patil   89   76         87           91
63        Rahul     Kadam   81   83         84           90
64          Jay    Bhagat   90   77         65           88

[65 rows x 6 columns]

In [44]:
dt.loc["One","First Name"]

'Vihaan'

In [46]:
# dt.iloc["One","First Name"]  ---> not possible

In [49]:
# dt.iloc[1,"First Name"]  --> after changing index number to string this will throw error

In [48]:
dt.head(1)

     First Name Last Name  English  Physics  Chemistry  Mathematics
Zero      Aarav     Patil       85       78         90           92

## Drop

In [50]:
# # Drop # Syntax
# # 1) Drop record (row)
# dataframe_name.drop([row_index], inplace= True/False) # By default axis=0

# # 2) Drop column
# dataframe_name.drop([column_name], axis=1, inplace= True/False)

In [51]:
# # If you want to delete
# rows use axis=0 ( By default axis value is 0 . Not mandadtory to define)
# Column use axis=1

In [52]:
dt

     First Name Last Name  English  Physics  Chemistry  Mathematics
Zero      Aarav     Patil       85       78         90           92
One      Vihaan  Deshmukh       88       81         85           89
Two       Ayaan    Jadhav       90       75         88           84
3         Arjun      More       76       89         91           78
4       Reyansh     Joshi       82       80         84           85
...         ...       ...      ...      ...        ...          ...
60        Tarun    Dhumal       82       87         81           85
61        Arnav   Khedkar       85       90         78           89
62        Payal     Patil       89       76         87           91
63        Rahul     Kadam       81       83         84           90
64          Jay    Bhagat       90       77         65           88

[65 rows x 6 columns]

In [54]:
dt.drop("Two",inplace=True)

In [55]:
dt

     First Name Last Name  English  Physics  Chemistry  Mathematics
Zero      Aarav     Patil       85       78         90           92
One      Vihaan  Deshmukh       88       81         85           89
3         Arjun      More       76       89         91           78
4       Reyansh     Joshi       82       80         84           85
5        Vivaan      Nair       87       83         79           90
...         ...       ...      ...      ...        ...          ...
60        Tarun    Dhumal       82       87         81           85
61        Arnav   Khedkar       85       90         78           89
62        Payal     Patil       89       76         87           91
63        Rahul     Kadam       81       83         84           90
64          Jay    Bhagat       90       77         65           88

[64 rows x 6 columns]

In [60]:
dt.drop("Physics",axis=1)

     First Name Last Name  English  Chemistry  Mathematics
Zero      Aarav     Patil       85         90           92
One      Vihaan  Deshmukh       88         85           89
3         Arjun      More       76         91           78
4       Reyansh     Joshi       82         84           85
5        Vivaan      Nair       87         79           90
...         ...       ...      ...        ...          ...
60        Tarun    Dhumal       82         81           85
61        Arnav   Khedkar       85         78           89
62        Payal     Patil       89         87           91
63        Rahul     Kadam       81         84           90
64          Jay    Bhagat       90         65           88

[64 rows x 5 columns]

In [61]:
dt.drop([4,5])

     First Name    Last Name  English  Physics  Chemistry  Mathematics
Zero      Aarav        Patil       85       78         90           92
One      Vihaan     Deshmukh       88       81         85           89
3         Arjun         More       76       89         91           78
6        Aditya        Pawar       92       88         76           91
7         Rohan  Suryavanshi       78       82         90           86
...         ...          ...      ...      ...        ...          ...
60        Tarun       Dhumal       82       87         81           85
61        Arnav      Khedkar       85       90         78           89
62        Payal        Patil       89       76         87           91
63        Rahul        Kadam       81       83         84           90
64          Jay       Bhagat       90       77         65           88

[62 rows x 6 columns]

In [63]:
dt.drop(["English","Physics"],axis=1)

     First Name Last Name  Chemistry  Mathematics
Zero      Aarav     Patil         90           92
One      Vihaan  Deshmukh         85           89
3         Arjun      More         91           78
4       Reyansh     Joshi         84           85
5        Vivaan      Nair         79           90
...         ...       ...        ...          ...
60        Tarun    Dhumal         81           85
61        Arnav   Khedkar         78           89
62        Payal     Patil         87           91
63        Rahul     Kadam         84           90
64          Jay    Bhagat         65           88

[64 rows x 4 columns]

In [64]:
dt

     First Name Last Name  English  Physics  Chemistry  Mathematics
Zero      Aarav     Patil       85       78         90           92
One      Vihaan  Deshmukh       88       81         85           89
3         Arjun      More       76       89         91           78
4       Reyansh     Joshi       82       80         84           85
5        Vivaan      Nair       87       83         79           90
...         ...       ...      ...      ...        ...          ...
60        Tarun    Dhumal       82       87         81           85
61        Arnav   Khedkar       85       90         78           89
62        Payal     Patil       89       76         87           91
63        Rahul     Kadam       81       83         84           90
64          Jay    Bhagat       90       77         65           88

[64 rows x 6 columns]

In [65]:
dt.drop(columns=["Physics","Chemistry"])

     First Name Last Name  English  Mathematics
Zero      Aarav     Patil       85           92
One      Vihaan  Deshmukh       88           89
3         Arjun      More       76           78
4       Reyansh     Joshi       82           85
5        Vivaan      Nair       87           90
...         ...       ...      ...          ...
60        Tarun    Dhumal       82           85
61        Arnav   Khedkar       85           89
62        Payal     Patil       89           91
63        Rahul     Kadam       81           90
64          Jay    Bhagat       90           88

[64 rows x 4 columns]

In [66]:
dt.drop(index=[3,4])

     First Name    Last Name  English  Physics  Chemistry  Mathematics
Zero      Aarav        Patil       85       78         90           92
One      Vihaan     Deshmukh       88       81         85           89
5        Vivaan         Nair       87       83         79           90
6        Aditya        Pawar       92       88         76           91
7         Rohan  Suryavanshi       78       82         90           86
...         ...          ...      ...      ...        ...          ...
60        Tarun       Dhumal       82       87         81           85
61        Arnav      Khedkar       85       90         78           89
62        Payal        Patil       89       76         87           91
63        Rahul        Kadam       81       83         84           90
64          Jay       Bhagat       90       77         65           88

[62 rows x 6 columns]